# vstSetEventResult

## Description
```pascal
PROCEDURE vstSetEventResult(inSetVal : LONGINT);
```

```python

def vs.vstSetEventResult(inSetVal):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inSetVal|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events